tests/pure_openfoam_cases/cbox/sim2/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel Newtonian;

// Laminar viscosity
nu              1e-03;

// Thermal expansion coefficient
beta            37.7166;

// Reference temperature
TRef            300;

// Laminar Prandtl number
Pr              1.0;

// Turbulent Prandtl number
Prt             1.0;
